# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# - при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9] -> 2, 4, 5, 9]


numbers = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]
unique_ = []

for i in numbers:
    count = numbers.count(i)
    if count == 1:
        unique_.append(i)

print(numbers)
print(unique_)